9/data/attachments/59118b04c9e86197.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Cheryl_old_Friend_31886_9</nif:username>
            <nif:friendToBeRequested>soap_friends_6e2c9cea-0d10-4338-8b40-66eaf03f2c02</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>